/* $ObjectName=MAFLogonUING_iOS */
/* $Collection=frwk.uicontrols.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable UI Components */

/* XFLD: label for a field */
"keyMAFLogonUIProgressDialogText" = "Logging in";

/* XFLD: label for a field */
"keyMAFLogonUIAlertViewButtonText" = "OK";

/* XHED: label for a field */
"keyMAFLogonUIAlertViewTitle" = "Error";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelServerHost" = "Server";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelResourcePath" = "URL Suffix";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelForceGatewayConnection" = "Gateway Only";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelServerPort" = "Port";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelServerDomain" = "Domain";

/* XFLD: label for a switch (on/off), max 18 chars */
"keyMAFLogonUIFieldLabelIsHttps" = "Secured Channel";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelBackendPassword" = "Password";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelBackendPasswordAgain" = "Confirm Password";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelFarmId" = "Farm ID";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSecurityConfig" = "Security Configuration";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelBackendUserName" = "User Name";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSecureStorePassword" = "New Passcode";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelCreateSecureStorePassword" = "Passcode";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSecureStorePasswordAgain" = "Confirm Passcode";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSecureStorePasswordOldWhenToogle" = "App Passcode";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSecureStorePasswordCurrent" = "Current App Passcode";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelMobileUser" = "Mobile User";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelActivationCode" = "Activation Code";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelGatewayClient" = "Client";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSSOPasscode" = "SSO Passcode";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelAfariaUserName" = "User Name";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelAfariaPassword" = "Password";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSSOPassword" = "Password";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelUserName" = "User Name";

/* XFLD: label for a field */
"keyMAFLogonUIFieldHintOptional" = "(Optional)";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelDeleteUser" = "Would you like to deactivate the application?";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelLock" = "Would you like to lock the application?";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelUpdateApplicationSettings" = "Would you like to update the application settings?";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelServerTrust" = "Do you trust this certificate?";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelUploadTrace" = "Would you like to upload the traces to the server?";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelTurnPasscodeOn" = "Turn Passcode On";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelTurnPasscodeOff" = "Turn Passcode Off";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelChangePasscode" = "Change Passcode";

/* XGRP: label for a group of fields */
"keyMAFLogonUIGroupTextForBasicRegistrationGroup" = "Login Data";

/* XGRP: label for a group of fields */
"keyMAFLogonUIGroupTextForHiddenGroupBasic" = "Details";

/* XGRP: label for a group of fields */
"keyMAFLogonUIGroupTextForPasswordCreation" = "App Passcode";

/* XGRP: label for a group of fields */
"keyMAFLogonUIGroupTextForPasswordChangeNewGroup" = "App Passcode";

/* XBUT */
"keyMAFLogonUIActionItemLabelRegistrationStart" = "Next";

/* XBUT */
"keyMAFLogonUIActionItemLabelStartLogon" = "Log In";

/* XBUT */
"keyMAFLogonUIActionItemLabelDemoMode" = "Try Out";

/* XBUT */
"keyMAFLogonUIActionItemLabelRegistrationCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelSecureStoreCreationStart" = "Done";

/* XBUT */
"keyMAFLogonUIActionItemLabelSecureStoreCreationCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelUnlockStart" = "Log In";

/* XBUT */
"keyMAFLogonUIActionItemLabelUnlockCancel" = "Forgot Passcode?";

/* XBUT */
"keyMAFLogonUIActionItemLabelLockStart" = "Lock";

/* XBUT */
"keyMAFLogonUIActionItemLabelLockCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelUpdateApplicationSettingsStart" = "Update";

/* XBUT */
"keyMAFLogonUIActionItemLabelUpdateApplicationSettingsCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelDeleteStart" = "Deactivate";

/* XBUT */
"keyMAFLogonUIActionItemLabelDeleteCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelChangeSecureStorePasswordStart" = "Done";

/* XBUT */
"keyMAFLogonUIActionItemLabelChangeSecureStorePasswordCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelChangeBackendPasswordStart" = "Done";

/* XBUT */
"keyMAFLogonUIActionItemLabelChangeBackendPasswordCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelRegistrationInfoCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelUploadTraceStart" = "Upload";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterSSOForgot" = "Forgot SSO Passcode";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterSSOSkip" = "Skip";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterAfariaStart" = "Done";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterAfariaCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelUploadTraceCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterSSOStart" = "Next";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterCredentialsStart" = "Next";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterCredentialsCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterPasscodeStart" = "Done";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterPasscodeCancel" = "Cancel";

/* XBUT */
"keyMAFLogonUIActionItemLabelPasscodeLockCancel" = "Back";

/* XBUT */
"keyMAFLogonUIActionItemLabelEnterSSOCancel" = "Cancel";

/* XHED */
"keyMAFLogonUIViewTitleLabelRegistrationScreen" = "Log in";

/* XHED */
"keyMAFLogonUIViewTitleLabelSSOPasscodeScreen" = "Enter SSO Passcode";

/* XHED */
"keyMAFLogonUIViewTitleLabelPasscodeLockScreen" = "Passcode lock";

/* XHED */
"keyMAFLogonUIViewTitleLabelEnterCredentialsScreen" = "Enter Credentials";

/* XHED */
"keyMAFLogonUIViewTitleLabelAfariCredentialsScreen" = "Afaria";

/* XHED */
"keyMAFLogonUIViewTitleLabelEnterPasscodeScreen" = "Enter Passcode";

/* XHED */
"keyMAFLogonUIViewTitleLabelSecureStoreCreationScreen" = "Set Passcode";

/* XHED */
"keyMAFLogonUIViewTitleLabelChangeSecureStorePasswordScreen" = "Change Passcode";

/* XHED */
"keyMAFLogonUIViewTitleLabelUnlockScreen" = "Log in";

/* XHED */
"keyMAFLogonUIViewTitleLabelDeleteScreen" = "Delete";

/* XHED */
"keyMAFLogonUIViewTitleLabelLockScreen" = "Lock";

/* XHED */
"keyMAFLogonUIViewTitleLabelUpdateScreen" = "Update";

/* XHED */
"keyMAFLogonUIViewTitleLabelUploadTraceScreen" = "Upload trace";

/* XHED */
"keyMAFLogonUIViewTitleLabelChangeBackendPasswordScreen" = "Update Password";

/* XHED */
"keyMAFLogonUIViewTitleLabelRegistrationInfoScreen" = "Login data";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelRegistrationScreen" = "Log in";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelSecureStoreCreationScreen" = "Set Passcode";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelSecureStoreCreationOptionalScreen" = "Set Passcode";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelEnterSSOScreen" = "Enter SSO Password";

/* XHED */
"keyMAFLogonUIHeaderTitleabelEnterAfariaScreen" = "Afaria";

/* XHED */
"keyMAFLogonUIHeaderTitleabelEnterCredentialsScreen" = "Enter Login Credentials";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelSecureStoreCreationOptionalInRegistrationScreen" = "Set Passcode";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelChangeSecureStorePasswordScreen" = "Change Passcode";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelChangeSecureStorePasswordOptionalScreen" = "Change Passcode";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelDeleteSecureStorePasswordScreen" = "Switch Off Passcode";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelUnlockScreen" = "Log in";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelDeleteScreen" = "Delete";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelLockScreen" = "Lock";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelUpdateScreen" = "Update";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelUploadTraceScreen" = "Upload trace";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelChangeBackendPasswordScreen" = "Update Password";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelRegistrationInfoScreen" = "Login data";

/* XHED */
"keyMAFLogonUIHeaderTitleLabelSplashScreen" = "SAP MAF Logon Sample";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelSplashScreen" = "If you do not have your own login data, you can try out the app using sample data.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelRegistrationScreen" = "Enter your login data to log in to the app. The app will remember this data.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelSecureStoreCreationScreen" = "You have to set an app passcode to protect the app from unauthorized use.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelSecureStoreCreationOptionalScreen" = "You can set an app passcode to protect the app from unauthorized use.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelSecureStoreCreationOptionalInRegistrationScreen" = "You can set an app passcode to protect the app from unauthorized use.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelChangeSecureStorePasswordScreen" = "Enter your old app passcode and then the new one to change the passcode.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelChangeSecureStorePasswordOptionalScreen" = "Enter your old app passcode and then the new one to change the passcode.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelDeleteSecureStorePasswordScreen" = "Enter your app passcode to switch off the passcode.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelUnlockScreen" = "Enter your app passcode to log in to the app.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelDeleteScreen" = "This is an example of a contextual approach for the logon sequence, using MAF components - Delete";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelLockScreen" = "This is an example of a contextual approach for the logon sequence, using MAF components - Lock";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelUpdateScreen" = "This is an example of a contextual approach for the logon sequence, using MAF components - Update";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelUploadTraceScreen" = "This is an example of a contextual approach for the logon sequence, using MAF components - Upload Trace";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelChangeBackendPasswordScreen" = "Enter your current password to update the password used for the app.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelRegistrationInfoScreen" = "You can display your login data for the app.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelEnterSSOScreen" = "Enter your password to work with Client Hub.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelEnterAfariaScreen" = "Enter your Afaria credentials.";

/* XMSG: message */
"keyMAFLogonUIHeaderDescriptionLabelEnterCredentialsScreen" = "Enter your credentials to log in to the app. The Client Hub app stores these credentials, and you can use them in other apps, as well.";

/* XMSG: message */
"keyMAFLogonUIConfirmationMessage" = "Are you sure you want to reset the app?";

/* XHED: message */
"keyMAFLogonUIConfirmationTitle" = "Confirmation";

/* XBUT */
"keyMAFLogonUIConfirmationCancelButtonLabel" = "Cancel";

/* XBUT */
"keyMAFLogonUIConfirmationOKButtonLabel" = "OK";

/* XMSG: message */
"keyMAFLogonUIFooterDescriptionLabel" = "2013 SAP AG";

/* XGRP */
"keyMAFLogonUIGroupTextForPasswordChangeGroupTitlePasscodeMandatory" = "Change App Passcode";

/* XGRP */
"keyMAFLogonUIGroupTextForPasswordChangeGroupTitleDefPasscodeUsed" = "Set App Passcode";

/* XFLD: label for a field */
"keyMAFLogonUIDeleteProgressDialogText" = "Deleting";

/* XFLD: label for a field */
"keyMAFLogonUIUpdateApplicationSettingsProgressDialogText" = "Updating";

/* XFLD: label for a field */
"keyMAFLogonUIUploadTraceProgressDialogText" = "Uploading";

/* XMSG: message */
"keyErrMAFLogonUINGRegistrationCancelled" = "Registration canceled.";

/* XMSG: message */
"keyErrMAFLogonUINGOperationCancelled" = "Operation cancelled.";

/* XMSG: message */
"keyErrMAFLogonUINGPasscodeChangeNotAllowed" = "Afaria passcode policy is \"always off\", so you cannot change the app passcode.";

/* XMSG: message */
"keyErrDescrMAFLogonUINGErrorPasswordsNotEqual" = "The passcodes you entered do not match.";

/* XMSG: message */
"keyErrMAFLogonUINGCannotRegisterUsingCertificate" = "Could not register using certificate registration type. Check if Afaria client installed properly, or if CertificateProvider is set.";

/* XHED: message */
"keyMAFLogonUIConfirmationEnterSSOAlertViewTitle" = "Forgot SSO Passcode";

/* XMSG: message */
"keyMAFLogonUIConfirmationEnterSSOAlertViewMessage" = "Reset SSO passcode in the Client Hub and restart the app.";

/* XMSG: message */
"keyMAFLogonUIConfirmationEnterSSORelaunchSkipAlertViewMessage" = "Skipping the SSO Entry will detach this app from the Client Hub.";

/* XMSG: message */
"keyErrDescrMAFLogonUINGMCIMSSOPinInvalid" = "Invalid SSO Passcode";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "Operation not allowed in this state.";

/* XMSG: message */
"keyErrMAFLogonUINGInvalidCharacter" = "%1$@ field contains invalid character";

/* XMSG: message */
"keyErrMAFLogonUINGInvalidLength" = "%1$@ length must be under %2$d characters";

/* XMSG: message */
"keyErrMAFLogonUINGInvalidPort" = "Port must be between 1 and 65535";

/* XFLD: label for a field */
"keyMAFLogonUIFieldLabelSecureStorePasswordOld" = "Old Passcode";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present information about the currently set timeout for the App Passcode. */
"keyMAFLogonUIFieldLabelApplicationTimeout" = "Timeout";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. */
"keyMAFLogonUIFieldLabelTimeoutImmediately" = "Immediately";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralSingleSecond" = "In %1$i sec.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralPlularSecond" = "In %1$i secs.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralSingle" = "In %1$i min.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralPlular" = "In %1$i mins.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralSingleHour" = "In %1$i hr.";

/* XFLD: label for a field. Length of translated text must not exceed 60 characters. Used to present currently set timeout for the App Passcode. Also used as a label in a cell to select the timeout value. */
"keyMAFLogonUIFieldLabelTimeoutGeneralPlularHour" = "In %1$i hrs.";

